frontend/controllers/CardController.php

    protected function findModel($id)
    {
        if (($model = Card::findOne($id)) !== null) {
---
SELECT * FROM `card` WHERE `id`='2'