frontend/controllers/UserInfoController.php

    protected function findModel($id)
    {
        if (($model = UserInfo::findOne($id)) !== null) {
---
SELECT * FROM `user_info` WHERE `id`='1380'