frontend/views/card/index.php


$this->title = 'Cards';
$this->params['breadcrumbs'][] = $this->title;
$refapp_arr =ArrayHelper::map(RefApp::find()->all(), 'id', 'appname') ;
---
SELECT * FROM `ref_app`

                'attribute'=>'refapp',
                'filter'=>$refapp_arr,
                'value' => function ($data) {
                    $refapp_arr =   ArrayHelper::map(RefApp::find()->all(), 'id', 'appname') ;
---
SELECT * FROM `ref_app`