common/models/Card.php

SELECT * FROM `user_info` WHERE `id`=2615
---
    public function getUser_info()
    {
     return   UserInfo::findOne(['id'=>$this->bind_uid]) ;

SELECT * FROM `ref_app` WHERE `id`=2
---
    public function getRef_app()
    {
        return   RefApp::findOne(['id'=>$this->refapp]) ;