common/models/CardSuite.php

    public static function ref_lebels ($id = null)
    {
        if (static::$_data==null) {
           static::$_data =ArrayHelper::map( self::find()->asArray()->all() , 'id','tname') ;
---
SELECT * FROM `card_suite`