common/models/User.php

    public static function ref_lebels2 ()
    {

        $data =ArrayHelper::map( self::find()->asArray()->where(['not like', 'username', 'appadmin'])->orderBy('username')->all() , 'id','username') ;
---
SELECT * FROM `user` WHERE `username` NOT LIKE '%appadmin%' ORDER BY `username`

    public static function ref_lebels_exclude_appadmin ()
    {
//         if (static::$_data_exclude_appadmin) {
//           return static::$_data_exclude_appadmin  ;
//         }else
//         {
//            static::$_data_exclude_appadmin =ArrayHelper::map( self::find()->where(['not like', 'username', 'appadmin'])->orderBy('username')->asArray()->all() , 'id','username') ;
//         }
        return ArrayHelper::map( self::find()->where(['not like', 'username', 'appadmin'])->orderBy('username')->asArray()->all() , 'id','username') ;
---
SELECT * FROM `user` WHERE `username` NOT LIKE '%appadmin%' ORDER BY `username`