common/models/UserInfo.php

    public static function ref_lebels ($id = null)
    {
//         $data =ArrayHelper::map( self::find()->asArray()->all() , 'id','user_name') ;
//         if ($id !== null && isset($data[$id])) {
//             return $data[$id];
//         } else {
//             return $data;
//         }
       if (static::$_data) {
           ;
       }else
        static::$_data =ArrayHelper::map( self::find()->orderBy("user_name")->asArray()->all() , 'id','user_name') ;
---
SELECT * FROM `user_info` ORDER BY `user_name`